#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НастройкиИнтеграции = ИнтеграционныйМодульТБанк.НастройкиИнтеграцииТБанк();
	
	ИнициализироватьНастройкиИнтеграции(НастройкиИнтеграции);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СохранитьНастройки(Команда)
	
	СохранитьНастройкиНаСервере();
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ИнициализироватьНастройкиИнтеграции(НастройкиИнтеграции)
	
	АдресПодключения = НастройкиИнтеграции.АдресПодключения;
	ТокенДоступа = НастройкиИнтеграции.ТокенДоступа;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройкиНаСервере()
	
	НастройкиИнтеграции = ИнтеграционныйМодульТБанк.НовыйПараметрыИнтеграцииТБанк();
	НастройкиИнтеграции.АдресПодключения = АдресПодключения;
	НастройкиИнтеграции.ТокенДоступа = ТокенДоступа;
	НастройкиИнтеграции.ИспользоватьИнтеграциюТБанк = ЗначениеЗаполнено(АдресПодключения) И ЗначениеЗаполнено(ТокенДоступа);
	
	ИнтеграционныйМодульТБанк.СохранитьНастройки(НастройкиИнтеграции);
	
КонецПроцедуры

#КонецОбласти