#Область ПрограммныйИнтерфейс

// Модуль по работе с активом.
// 
// Параметры:
//  Актив - ОпределяемыйТип.Актив
// 
// Возвращаемое значение:
//  СправочникМенеджер.Акции, СправочникМенеджер.Облигации, СправочникМенеджер.Криптовалюты - Модуль по работе с активом
//
Функция МодульПоРаботеСАктивом(Актив) Экспорт
	
	Если ТипЗнч(Актив) = Тип("СправочникСсылка.Акции") Тогда
		Возврат Справочники.Акции;
	ИначеЕсли ТипЗнч(Актив) = Тип("СправочникСсылка.Облигации") Тогда
		Возврат Справочники.Облигации;
	ИначеЕсли ТипЗнч(Актив) = Тип("СправочникСсылка.Криптовалюты") Тогда
		Возврат Справочники.Криптовалюты;
	Иначе
		ВызватьИсключение НСтр("ru='Фабрика по работе с активом не определена'");
	КонецЕсли;
	
КонецФункции

#КонецОбласти