#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныйПрограммныйИнтерфейс  

Функция СоздатьНовыйЭлемент(Параметры) Экспорт
	
	Элемент = СоздатьЭлемент();
	Элемент.Заполнить(Параметры);
	
	Если Элемент.ПроверитьЗаполнение() Тогда
		Элемент.Записать();
	Иначе
		ВызватьИсключение НСтр("ru='Не удалось записать нового эмитента, проверка заполнения не пройдена.'");	
	КонецЕсли;
	
	Возврат Элемент.Ссылка
	
КонецФункции

Функция НовыйПараметрыЭмитента() Экспорт
	
	Параметры = Новый Структура;
	Параметры.Вставить("Наименование", "");
	Параметры.Вставить("Сектор", Справочники.СектораЭкономики.ПустаяСсылка());
	Параметры.Вставить("УровеньРиска", Перечисления.УровниРискаЭмитента.ПустаяСсылка());
	
	Возврат Параметры;
	
КонецФункции

#КонецОбласти

#КонецЕсли