#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныйПрограммныйИнтерфейс  

Процедура СоздатьНовыйЭлемент(Параметры) Экспорт
	
	Элемент = СоздатьЭлемент();
	Элемент.Заполнить(Параметры);
	
	Если Элемент.ПроверитьЗаполнение() Тогда
		Элемент.Записать();
	Иначе
		ВызватьИсключение НСтр("ru='Не удалось записать новый облигационный актив, проверка заполнения не пройдена.'");	
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновитьДанные(Акция, ПараметрыОбновления) Экспорт
	
	АкцияОбъект = Акция.ПолучитьОбъект();
	АкцияОбъект.Заполнить(ПараметрыОбновления);
	
	Если АкцияОбъект.ПроверитьЗаполнение() Тогда
		АкцияОбъект.Записать();
	Иначе
		ВызватьИсключение НСтр("ru='Не удалось записать новый облигационный актив, проверка заполнения не пройдена.'");	
	КонецЕсли;
	
КонецПроцедуры

Функция НовыйПараметрыЗаписи() Экспорт
	
	Параметры = Новый Структура;
	Параметры.Вставить("Наименование", "");
	Параметры.Вставить("Тикер", "");
	Параметры.Вставить("ISIN", "");
	Параметры.Вставить("Эмитент", Справочники.Эмитенты.ПустаяСсылка());
	Параметры.Вставить("ИдентификаторАктива", "");
	
	Возврат Параметры;
	
КонецФункции

#КонецОбласти
	
#КонецЕсли