#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НастройкиИнтеграции = ИнтеграционныйМодульCryptoRank.НастройкиИнтеграцииCryptoRank();
	
	ИнициализироватьНастройкиИнтеграции(НастройкиИнтеграции);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СохранитьНастройки(Команда)
	
	СохранитьНастройкиНаСервере();
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ИнициализироватьНастройкиИнтеграции(НастройкиИнтеграции)
	
	АдресПодключения = НастройкиИнтеграции.АдресПодключения;
	КлючAPI = НастройкиИнтеграции.КлючAPI;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройкиНаСервере()
	
	НастройкиИнтеграции = ИнтеграционныйМодульCryptoRank.НовыйПараметрыИнтеграцииCryptoRank();
	НастройкиИнтеграции.АдресПодключения = АдресПодключения;
	НастройкиИнтеграции.КлючAPI = КлючAPI;
	
	ИнтеграционныйМодульCryptoRank.СохранитьНастройки(НастройкиИнтеграции);
	
КонецПроцедуры

#КонецОбласти