
#Область ПрограммныйИнтерфейс

// Настройки интеграции Т-Банк.
// 
// Возвращаемое значение:
//  Структура - Настройки интеграции Т-Банк:
// * АдресПодключения - Строка
// * ТокенДоступа - Строка 
// * ИспользоватьИнтеграциюТБанк - Булево
//
Функция НастройкиИнтеграцииТБанк() Экспорт
	
	ПараметрыИнтеграции = НовыйПараметрыИнтеграцииТБанк();
	ТекущиеПараметры = Константы.НастройкиИнтеграцииТБанк.Получить().Получить(); 
	
	Если ЗначениеЗаполнено(ТекущиеПараметры) Тогда
		ЗаполнитьЗначенияСвойств(ПараметрыИнтеграции, ТекущиеПараметры);
		ПараметрыИнтеграции.ИспользоватьИнтеграциюТБанк = Константы.ИспользоватьИнтеграциюТБанк.Получить();
	КонецЕсли;	
	
	Возврат ПараметрыИнтеграции;
	
КонецФункции

// Сохранить настройки.
// 
// Параметры:
//  НастройкиИнтеграции - Структура - Настройки интеграции Т-Банк:
// 	* АдресПодключения - Строка
// 	* ТокенДоступа - Строка 
// 	* ИспользоватьИнтеграциюТБанк - Булево
//
Процедура СохранитьНастройки(НастройкиИнтеграции) Экспорт
	
	Константы.НастройкиИнтеграцииТБанк.Установить(Новый ХранилищеЗначения(НастройкиИнтеграции));
	Константы.ИспользоватьИнтеграциюТБанк.Установить(НастройкиИнтеграции.ИспользоватьИнтеграциюТБанк);
	
КонецПроцедуры

// Обновить нормативно справочную информацию.
//
Процедура ОбновитьНормативноСправочнуюИнформацию() Экспорт
	
	НастройкиИнтеграции = НастройкиИнтеграцииТБанк();
	
	Если Не НастройкиИнтеграции.ИспользоватьИнтеграциюТБанк Тогда
		ОбщегоНазначения.СообщитьПользователю("Настройки интеграции с Т-Банк не установлены. Обновить НСИ невозможно.");
		Возврат;
	КонецЕсли;
	
	ОбновитьСписокОблигацийТоргуемыхНаБирже(НастройкиИнтеграции);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция НовыйПараметрыИнтеграцииТБанк() Экспорт
	
	ПараметрыИнтеграции = Новый Структура;
	ПараметрыИнтеграции.Вставить("АдресПодключения", "");
	ПараметрыИнтеграции.Вставить("ТокенДоступа", "");
	ПараметрыИнтеграции.Вставить("ИспользоватьИнтеграциюТБанк", Ложь);
	
	Возврат ПараметрыИнтеграции;
	
КонецФункции

Процедура ОбновитьСписокОблигацийТоргуемыхНаБирже(НастройкиИнтеграции) Экспорт
	
	ДополнительныеПараметры = КоннекторHTTP.НовыеПараметры();
	ДополнительныеПараметры.Заголовки.Вставить("Accepts", "application/json");
	ДополнительныеПараметры.Заголовки.Вставить("Content-Type", "application/json");
	ДополнительныеПараметры.Заголовки.Вставить("Authorization", СтрШаблон("Bearer %1",
		НастройкиИнтеграции.ТокенДоступа));

	СтрокаПодключения = СтрШаблон("%1/rest/tinkoff.public.invest.api.contract.v1.InstrumentsService/Bonds",
		НастройкиИнтеграции.АдресПодключения);
	
	Ответ =  КоннекторHTTP.PostJson(СтрокаПодключения,, ДополнительныеПараметры);
	
	ИнтеграционныйМодульТБанкСлужебный.РазобратьОтветПоСпискуОблигаций(Ответ);
	
КонецПроцедуры

#КонецОбласти