
#Область ПрограммныйИнтерфейс

// Настройки интеграции Т-Банк.
// 
// Возвращаемое значение:
//  Структура - Настройки интеграции Т-Банк:
// * АдресПодключения - Строка
// * ТокенДоступа - Строка 
// * ИспользоватьИнтеграциюТБанк - Булево
//
Функция НастройкиИнтеграцииТБанк() Экспорт
	
	ПараметрыИнтеграции = НовыйПараметрыИнтеграцииТБанк();
	ТекущиеПараметры = Константы.НастройкиИнтеграцииТБанк.Получить().Получить(); 
	
	Если ЗначениеЗаполнено(ТекущиеПараметры) Тогда
		ЗаполнитьЗначенияСвойств(ПараметрыИнтеграции, ТекущиеПараметры);
		ПараметрыИнтеграции.ИспользоватьИнтеграциюТБанк = Константы.ИспользоватьИнтеграциюТБанк.Получить();
	КонецЕсли;	
	
	Возврат ПараметрыИнтеграции;
	
КонецФункции

// Сохранить настройки.
// 
// Параметры:
//  НастройкиИнтеграции - Структура - Настройки интеграции Т-Банк:
// 	* АдресПодключения - Строка
// 	* ТокенДоступа - Строка 
// 	* ИспользоватьИнтеграциюТБанк - Булево
//
Процедура СохранитьНастройки(НастройкиИнтеграции) Экспорт
	
	Константы.НастройкиИнтеграцииТБанк.Установить(Новый ХранилищеЗначения(НастройкиИнтеграции));
	Константы.ИспользоватьИнтеграциюТБанк.Установить(НастройкиИнтеграции.ИспользоватьИнтеграциюТБанк);
	
КонецПроцедуры

// Обновить нормативно справочную информацию.
//
Процедура ОбновитьНормативноСправочнуюИнформацию() Экспорт
	
	НастройкиИнтеграции = НастройкиИнтеграцииТБанк();
	
	Если Не НастройкиИнтеграции.ИспользоватьИнтеграциюТБанк Тогда
		ОбщегоНазначения.СообщитьПользователю("Настройки интеграции с Т-Банк не установлены. Обновить НСИ невозможно.");
		Возврат;
	КонецЕсли;
	
	ОбновитьСписокВалют();
	ОбновитьСписокЭмитентов(НастройкиИнтеграции);
	ОбновитьСписокОблигацийТоргуемыхНаБирже(НастройкиИнтеграции);
	СопоставитьЭмитентовИОблигацииВыпускаемые(НастройкиИнтеграции);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция НовыйПараметрыИнтеграцииТБанк() Экспорт
	
	ПараметрыИнтеграции = Новый Структура;
	ПараметрыИнтеграции.Вставить("АдресПодключения", "");
	ПараметрыИнтеграции.Вставить("ТокенДоступа", "");
	ПараметрыИнтеграции.Вставить("ИспользоватьИнтеграциюТБанк", Ложь);
	
	Возврат ПараметрыИнтеграции;
	
КонецФункции

Процедура ОбновитьСписокОблигацийТоргуемыхНаБирже(НастройкиИнтеграции) Экспорт
	
	ДополнительныеПараметры = КоннекторHTTP.НовыеПараметры();
	ДополнительныеПараметры.Заголовки.Вставить("Accepts", "application/json");
	ДополнительныеПараметры.Заголовки.Вставить("Content-Type", "application/json");
	ДополнительныеПараметры.Заголовки.Вставить("Authorization", СтрШаблон("Bearer %1",
		НастройкиИнтеграции.ТокенДоступа));
		
	ДополнительныеПараметры.Таймаут = 60;
		
	СтрокаПодключения = СтрШаблон("%1/rest/tinkoff.public.invest.api.contract.v1.InstrumentsService/Bonds",
		НастройкиИнтеграции.АдресПодключения);    
		
	Данные = Новый Структура;
	Данные.Вставить("instrumentStatus", "INSTRUMENT_STATUS_UNSPECIFIED");
	Данные.Вставить("instrumentExchange", "INSTRUMENT_EXCHANGE_UNSPECIFIED");
	
	Ответ = КоннекторHTTP.PostJson(СтрокаПодключения, Данные, ДополнительныеПараметры);
	
	ИнтеграционныйМодульТБанкСлужебный.РазобратьОтветПоСпискуОблигаций(Ответ);
	
КонецПроцедуры

Процедура ОбновитьСписокЭмитентов(НастройкиИнтеграции) Экспорт
	
	ДополнительныеПараметры = КоннекторHTTP.НовыеПараметры();
	ДополнительныеПараметры.Заголовки.Вставить("Accepts", "application/json");
	ДополнительныеПараметры.Заголовки.Вставить("Content-Type", "application/json");
	ДополнительныеПараметры.Заголовки.Вставить("Authorization", СтрШаблон("Bearer %1",
		НастройкиИнтеграции.ТокенДоступа));
		
	ДополнительныеПараметры.Таймаут = 60;
		
	СтрокаПодключения = СтрШаблон("%1/rest/tinkoff.public.invest.api.contract.v1.InstrumentsService/GetBrands",
		НастройкиИнтеграции.АдресПодключения);    
		
	Данные = Новый Структура;
	Данные.Вставить("paging", НовыйДанныеПагинации());
	
	Ответ = КоннекторHTTP.PostJson(СтрокаПодключения, Данные, ДополнительныеПараметры);
	
	ИнтеграционныйМодульТБанкСлужебный.РазобратьОтветПоСпискуЭмитентов(Ответ);

КонецПроцедуры

Процедура ОбновитьСписокВалют() Экспорт
	
	ДанныеОбновления = Новый Массив;
	ДанныеОбновления.Добавить("840"); // USD
	ДанныеОбновления.Добавить("643"); // RUB
	ДанныеОбновления.Добавить("978"); // EUR
	ДанныеОбновления.Добавить("156"); // CNY
	
	РаботаСКурсамиВалют.ДобавитьВалютыПоКоду(ДанныеОбновления);
	
КонецПроцедуры

Процедура СопоставитьЭмитентовИОблигацииВыпускаемые(НастройкиИнтеграции) Экспорт
	
	ДополнительныеПараметры = КоннекторHTTP.НовыеПараметры();
	ДополнительныеПараметры.Заголовки.Вставить("Accepts", "application/json");
	ДополнительныеПараметры.Заголовки.Вставить("Content-Type", "application/json");
	ДополнительныеПараметры.Заголовки.Вставить("Authorization", СтрШаблон("Bearer %1",
		НастройкиИнтеграции.ТокенДоступа));
		
	ДополнительныеПараметры.Таймаут = 60;

	СтрокаПодключения = СтрШаблон("%1/rest/tinkoff.public.invest.api.contract.v1.InstrumentsService/GetAssetBy",
		НастройкиИнтеграции.АдресПодключения);

	ОблигацииСНеопределеннымЭмитентом = Справочники.Облигации.ОблигацииСИдентификаторамиАктивовСНеопределеннымЭмитентом();
	
	ДанныеОблигациийИЭмитентов = ДанныеОблигациийИЭмитентов();
	Для Каждого Облигация Из ОблигацииСНеопределеннымЭмитентом Цикл
		
		Данные = Новый Структура;
		Данные.Вставить("id", Облигация.ИдентификаторАктива);	
		Ответ = КоннекторHTTP.PostJson(СтрокаПодключения, Данные, ДополнительныеПараметры);
		
		СтрокаОблигацийИЭмитентов = ДанныеОблигациийИЭмитентов.Добавить();
		СтрокаОблигацийИЭмитентов.Ссылка = Облигация.Ссылка;
		СтрокаОблигацийИЭмитентов.Идентификатор = Ответ["asset"]["brand"]["uid"];
				
	КонецЦикла;
	
	ИнтеграционныйМодульТБанкСлужебный.СинхронизироватьЭмитентовПоОблигациям(ДанныеОблигациийИЭмитентов);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Новый данные пагинации.
// 
// Возвращаемое значение:
//  Структура - Новый данные пагинации:
// * limit - Число - Максимальное число возвращаемых записей.
// * pageNumber - Число - Порядковый номер страницы, начиная с 0.
//
Функция НовыйДанныеПагинации()
	
	ДанныеПагинации = Новый Структура;
	ДанныеПагинации.Вставить("limit", 10000);
	ДанныеПагинации.Вставить("pageNumber", 0);
	
	Возврат ДанныеПагинации;
	
КонецФункции

Функция ДанныеОблигациийИЭмитентов()
	
	ДанныеОблигациийИЭмитентов = Новый ТаблицаЗначений;
	ДанныеОблигациийИЭмитентов.Колонки.Добавить("Ссылка", Новый ОписаниеТипов("СправочникСсылка.Облигации"));
	ДанныеОблигациийИЭмитентов.Колонки.Добавить("Идентификатор", ОбщегоНазначения.ОписаниеТипаСтрока(50)); 
	
	Возврат ДанныеОблигациийИЭмитентов;
	
КонецФункции

#КонецОбласти
