#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Создать новую запись.
// 
// Параметры:
//  ПараметрыЗаписи - см. НовыйПараметрыЗаписи
//
Процедура СоздатьНовуюЗапись(ПараметрыЗаписи) Экспорт
	
	МенеджерЗаписи = СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Заполнить(ПараметрыЗаписи);
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Новый параметры записи.
// 
// Возвращаемое значение:
//  Структура - Новый параметры записи:
// * Актив - Неопределено 
// * ИдентификаторЭмитента - Строка
// * СтатусОбработки - ПеречислениеСсылка.СтатусыОбработкиОчередей
//
Функция НовыйПараметрыЗаписи() Экспорт
	
	ПараметрыЗаписи = Новый Структура;
	ПараметрыЗаписи.Вставить("Актив", Неопределено);
	ПараметрыЗаписи.Вставить("ИдентификаторЭмитента", "");
	ПараметрыЗаписи.Вставить("СтатусОбработки", Перечисления.СтатусыОбработкиОчередей.НеОбработан);
	
	Возврат ПараметрыЗаписи;
	
КонецФункции

#КонецОбласти
	
#КонецЕсли