#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныйПрограммныйИнтерфейс  

Процедура СоздатьНовыйЭлемент(Параметры) Экспорт
	
	Элемент = СоздатьЭлемент();
	Элемент.Заполнить(Параметры);
	
	Если Элемент.ПроверитьЗаполнение() Тогда
		Элемент.Записать();
	Иначе
		ВызватьИсключение НСтр("ru='Не удалось записать новый облигационный актив, проверка заполнения не пройдена.'");	
	КонецЕсли;
	
КонецПроцедуры

Функция ОблигацииСИдентификаторамиАктивовСНеопределеннымЭмитентом() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Облигации.Ссылка КАК Ссылка,
	|	Облигации.ИдентификаторАктива КАК ИдентификаторАктива
	|ИЗ
	|	Справочник.Облигации КАК Облигации
	|ГДЕ
	|	Облигации.Эмитент = ЗНАЧЕНИЕ(Справочник.Эмитенты.ПустаяСсылка)
	|";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция НовыйПараметрыОблигации() Экспорт
	
	Параметры = Новый Структура;
	Параметры.Вставить("Наименование", "");
	Параметры.Вставить("Тикер", "");
	Параметры.Вставить("ISIN", "");
	Параметры.Вставить("Номинал", 0);
	Параметры.Вставить("Эмитент", Справочники.Эмитенты.ПустаяСсылка());
	Параметры.Вставить("Валюта", Справочники.Валюты.ПустаяСсылка());
	Параметры.Вставить("ДатаПогашения", Дата(1, 1, 1));
	Параметры.Вставить("ИдентификаторАктива", "");
	
	Возврат Параметры;
	
КонецФункции

#КонецОбласти
	
#КонецЕсли