#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныйПрограммныйИнтерфейс  

Процедура СоздатьНовыйЭлемент(Параметры) Экспорт
	
	Элемент = СоздатьЭлемент();
	Элемент.Заполнить(Параметры);
	
	Если Элемент.ПроверитьЗаполнение() Тогда
		Элемент.Записать();
	Иначе
		ВызватьИсключение НСтр("ru='Не удалось записать новый облигационный актив, проверка заполнения не пройдена.'");	
	КонецЕсли;
	
КонецПроцедуры

Функция НовыйПараметрыОблигации() Экспорт
	
	Параметры = Новый Структура;
	Параметры.Вставить("Наименование", "");
	Параметры.Вставить("Тикер", "");
	Параметры.Вставить("ISIN", "");
	Параметры.Вставить("Номинал", 0);
	Параметры.Вставить("Эмитент", Справочники.Эмитенты.ПустаяСсылка());
	Параметры.Вставить("Валюта", Справочники.Валюты.ПустаяСсылка());
	Параметры.Вставить("ДатаПогашения", Дата(1, 1, 1));
	
	Возврат Параметры;
	
КонецФункции

#КонецОбласти
	
#КонецЕсли