#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.ИнвестиционнаяДеятельность.Записывать = Истина;
	СформироватьДвиженияПоИнвестиционнойДеятельности();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СформироватьДвиженияПоИнвестиционнойДеятельности()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Инвестиции.Ссылка       КАК Регистратор,
	|	Инвестиции.Дата         КАК Период,
	|	Инвестиции.КомиссияСети КАК КомиссияСети,
	|	Инвестиции.СуммаВUSDT   КАК СуммаВUSDT,
	|	Инвестиции.СуммаВРублях КАК СуммаВРублях
	|ИЗ
	|	Документ.Инвестиции КАК Инвестиции
	|ГДЕ
	|	Инвестиции.Ссылка = &Ссылка";

	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Движение = Движения.ИнвестиционнаяДеятельность.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, ВыборкаДетальныеЗаписи);
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#КонецЕсли