#Область СлужебныйПрограммныйИнтерфейс

Процедура РазобратьОтветПоСпискуОблигаций(Ответ) Экспорт 
	
	ДанныеОблигаций = НовыйАдаптерОблигациийИнтеграционнойЧастиВБизнесЛогику();
	
	Для Каждого Инструменты Из Ответ Цикл
		Облигации = Инструменты.Значение;
		Для Каждого Облигация Из Облигации Цикл
			СтрокаОблигаций = ДанныеОблигаций.Добавить();
			СтрокаОблигаций.Наименование = Облигация["name"];
			СтрокаОблигаций.ISIN = Облигация["isin"];
			СтрокаОблигаций.Тикер = Облигация["ticker"];
			СтрокаОблигаций.Валюта = ВРег(Облигация["currency"]);
			Если ЗначениеЗаполнено(Облигация["maturityDate"]) Тогда
				СтрокаОблигаций.ДатаПогашения = ПрочитатьДатуJSON(Облигация["maturityDate"], ФорматДатыJSON.ISO);
			КонецЕсли;
			СтрокаОблигаций.Номинал = Число(Облигация["nominal"]["units"]);
			СтрокаОблигаций.ИдентификаторАктива = Облигация["assetUid"];
		КонецЦикла;
	КонецЦикла;
	
	ПреобразоватьДанныеОблигацийВБизнесЛогику(ДанныеОблигаций);
	
КонецПроцедуры

Процедура РазобратьОтветПоСпискуЭмитентов(Ответ) Экспорт
	
	ДанныеЭмитентов = НовыйАдаптерЭмитентовИнтеграционнойЧастиВБизнесЛогику();
	
	Эмитенты = Ответ["brands"];
	
	Для Каждого Эмитент Из Эмитенты Цикл
		СтрокаЭмитента = ДанныеЭмитентов.Добавить();
		СтрокаЭмитента.Наименование = Эмитент["name"];
		СтрокаЭмитента.Сектор = Эмитент["sector"];
		СтрокаЭмитента.Описание = Эмитент["description"];
		СтрокаЭмитента.Идентификатор = Эмитент["uid"];
	КонецЦикла;
	
	ПреобразоватьДанныеЭмитентаВБизнесЛогику(ДанныеЭмитентов);
	
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции  

Функция НовыйАдаптерОблигациийИнтеграционнойЧастиВБизнесЛогику()  
	
	ДанныеОблигаций = Новый ТаблицаЗначений;
	ДанныеОблигаций.Колонки.Добавить("Наименование", ОбщегоНазначения.ОписаниеТипаСтрока(50));
	ДанныеОблигаций.Колонки.Добавить("Валюта", ОбщегоНазначения.ОписаниеТипаСтрока(50));
	ДанныеОблигаций.Колонки.Добавить("Тикер", ОбщегоНазначения.ОписаниеТипаСтрока(20));
	ДанныеОблигаций.Колонки.Добавить("ISIN", ОбщегоНазначения.ОписаниеТипаСтрока(20));
	ДанныеОблигаций.Колонки.Добавить("ДатаПогашения", ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата));
	ДанныеОблигаций.Колонки.Добавить("Номинал", ОбщегоНазначения.ОписаниеТипаЧисло(10)); 
	ДанныеОблигаций.Колонки.Добавить("ИдентификаторАктива", ОбщегоНазначения.ОписаниеТипаСтрока(50));
	
	Возврат ДанныеОблигаций;
	
КонецФункции

Функция НовыйАдаптерЭмитентовИнтеграционнойЧастиВБизнесЛогику()  
	
	ДанныеЭмитентов = Новый ТаблицаЗначений;
	ДанныеЭмитентов.Колонки.Добавить("Наименование", ОбщегоНазначения.ОписаниеТипаСтрока(50));
	ДанныеЭмитентов.Колонки.Добавить("Сектор", ОбщегоНазначения.ОписаниеТипаСтрока(50));
	ДанныеЭмитентов.Колонки.Добавить("Описание", ОбщегоНазначения.ОписаниеТипаСтрока(1000)); 
	ДанныеЭмитентов.Колонки.Добавить("Идентификатор", ОбщегоНазначения.ОписаниеТипаСтрока(50)); 
	
	Возврат ДанныеЭмитентов;
	
КонецФункции

Процедура ПреобразоватьДанныеОблигацийВБизнесЛогику(ДанныеОблигаций)
	
	СписокНовыхОблигаций = СписокОблигацийНеподгруженныхВСистему(ДанныеОблигаций);
	Валюты = СписокВалютПоДаннымОблигаций(ДанныеОблигаций);
	
	Для Каждого Облигация Из СписокНовыхОблигаций Цикл
		Параметры = Справочники.Облигации.НовыйПараметрыОблигации();
		ЗаполнитьЗначенияСвойств(Параметры, Облигация);	
		Параметры.Валюта = Валюты[Облигация.Валюта];
		Справочники.Облигации.СоздатьНовыйЭлемент(Параметры);	
	КонецЦикла;
	
КонецПроцедуры

Процедура ПреобразоватьДанныеЭмитентаВБизнесЛогику(ДанныеЭмитента)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДанныеЭмитентов.Сектор КАК Сектор,
	|	ДанныеЭмитентов.Наименование КАК Эмитент,
	|	ДанныеЭмитентов.Описание КАК Описание,
	|	ДанныеЭмитентов.Идентификатор КАК Идентификатор
	|ПОМЕСТИТЬ ВТ_ДанныеЭмитентов
	|ИЗ
	|	&ДанныеЭмитентов КАК ДанныеЭмитентов
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Идентификатор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеЭмитентов.Эмитент КАК Эмитент,
	|	ВТ_ДанныеЭмитентов.Сектор КАК Сектор,
	|	ВТ_ДанныеЭмитентов.Описание КАК Описание,
	|	ВТ_ДанныеЭмитентов.Идентификатор КАК Идентификатор,
	|	ЕСТЬNULL(Эмитенты.Ссылка, ЗНАЧЕНИЕ(Справочник.Эмитенты.ПустаяСсылка)) КАК Ссылка
	|ИЗ
	|	ВТ_ДанныеЭмитентов КАК ВТ_ДанныеЭмитентов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Эмитенты КАК Эмитенты
	|		ПО ВТ_ДанныеЭмитентов.Идентификатор = Эмитенты.Идентификатор
	|ГДЕ
	|	Эмитенты.Ссылка ЕСТЬ NULL
	|";

	Запрос.УстановитьПараметр("ДанныеЭмитентов", ДанныеЭмитента);

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	СектораЭкономики = СектораЭкономики();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Параметры = Справочники.Эмитенты.НовыйПараметрыЭмитента();
		Параметры.Наименование = ВыборкаДетальныеЗаписи.Эмитент;
		Параметры.Сектор = СектораЭкономики[ВыборкаДетальныеЗаписи.Сектор];
		Параметры.Описание = ВыборкаДетальныеЗаписи.Описание;
		Параметры.Идентификатор = ВыборкаДетальныеЗаписи.Идентификатор;
		Справочники.Эмитенты.СоздатьНовыйЭлемент(Параметры);		
	КонецЦикла;
	
КонецПроцедуры

Функция СектораЭкономики()
	
	СектораЭкономики = Новый Соответствие;
	СектораЭкономики.Вставить("government", Справочники.СектораЭкономики.Государство);
	СектораЭкономики.Вставить("financial", Справочники.СектораЭкономики.Финансы);
	СектораЭкономики.Вставить("materials", Справочники.СектораЭкономики.Сырьё);
	СектораЭкономики.Вставить("consumer", Справочники.СектораЭкономики.ПотребительскийСектор);
	СектораЭкономики.Вставить("real_estate", Справочники.СектораЭкономики.Недвижимость);
	СектораЭкономики.Вставить("industrials", Справочники.СектораЭкономики.Промышленность);
	СектораЭкономики.Вставить("telecom", Справочники.СектораЭкономики.Телекоммуникации);
	СектораЭкономики.Вставить("utilities", Справочники.СектораЭкономики.КоммунальноеХозяйство);
	СектораЭкономики.Вставить("municipal", Справочники.СектораЭкономики.Муниципальный);
	СектораЭкономики.Вставить("it", Справочники.СектораЭкономики.IT);
	СектораЭкономики.Вставить("health_care", Справочники.СектораЭкономики.Здравоохранение);
	СектораЭкономики.Вставить("other", Справочники.СектораЭкономики.Прочее);
	СектораЭкономики.Вставить("energy", Справочники.СектораЭкономики.Энергетика);
	СектораЭкономики.Вставить("", Справочники.СектораЭкономики.ПустаяСсылка());
	
	Возврат СектораЭкономики;
	
КонецФункции

Функция СписокОблигацийНеподгруженныхВСистему(ДанныеОблигаций)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДанныеОблигаций.Наименование КАК Наименование,
	|	ДанныеОблигаций.Валюта КАК Валюта,
	|	ДанныеОблигаций.Тикер КАК Тикер,
	|	ДанныеОблигаций.ISIN КАК ISIN,
	|	ДанныеОблигаций.ДатаПогашения КАК ДатаПогашения,
	|	ДанныеОблигаций.Номинал КАК Номинал,
	|	ДанныеОблигаций.ИдентификаторАктива КАК ИдентификаторАктива
	|ПОМЕСТИТЬ ВТ_ДанныеОблигаций
	|ИЗ
	|	&ДанныеОблигаций КАК ДанныеОблигаций
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ISIN
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеОблигаций.Наименование КАК Наименование,
	|	ВТ_ДанныеОблигаций.Валюта КАК Валюта,
	|	ВТ_ДанныеОблигаций.Тикер КАК Тикер,
	|	ВТ_ДанныеОблигаций.ISIN КАК ISIN,
	|	ВТ_ДанныеОблигаций.ДатаПогашения КАК ДатаПогашения,
	|	ВТ_ДанныеОблигаций.Номинал КАК Номинал,
	|	ВТ_ДанныеОблигаций.ИдентификаторАктива КАК ИдентификаторАктива
	|ИЗ
	|	ВТ_ДанныеОблигаций КАК ВТ_ДанныеОблигаций
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Облигации КАК Облигации
	|		ПО ВТ_ДанныеОблигаций.ISIN = Облигации.ISIN
	|ГДЕ
	|	Облигации.Ссылка ЕСТЬ NULL";

	Запрос.УстановитьПараметр("ДанныеОблигаций", ДанныеОблигаций);

	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

Функция СписокВалютПоДаннымОблигаций(ДанныеВалют)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеВалют.Валюта КАК Валюта
	|ПОМЕСТИТЬ ВТ_ДанныеВалют
	|ИЗ
	|	&ДанныеВалют КАК ДанныеВалют
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Валюта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеВалют.Валюта КАК Валюта,
	|	ЕСТЬNULL(Валюты.Ссылка, ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)) КАК Ссылка
	|ИЗ
	|	ВТ_ДанныеВалют КАК ВТ_ДанныеВалют
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Валюты КАК Валюты
	|		ПО ВТ_ДанныеВалют.Валюта = Валюты.Наименование
	|";
	
	Запрос.УстановитьПараметр("ДанныеВалют", ДанныеВалют);
	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	СписокВалютПоДаннымОблигаций = Новый Соответствие;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл	
		СписокВалютПоДаннымОблигаций.Вставить(ВыборкаДетальныеЗаписи.Валюта, ВыборкаДетальныеЗаписи.Ссылка);	
	КонецЦикла;
	
	Возврат СписокВалютПоДаннымОблигаций;
	
КонецФункции

#КонецОбласти