#Область СлужебныйПрограммныйИнтерфейс

Процедура РазобратьОтветПоСпискуОблигаций(Ответ) Экспорт 
	
	ДанныеОблигаций = НовыйДанныеОблигациий();
	
	Для Каждого Инструменты Из Ответ Цикл
		Облигации = Инструменты.Значение;
		Для Каждого Облигация Из Облигации Цикл
			СтрокаОблигаций = ДанныеОблигаций.Добавить();
			СтрокаОблигаций.Наименование = Облигация["name"];
			СтрокаОблигаций.ISIN = Облигация["isin"];
			СтрокаОблигаций.Тикер = Облигация["ticker"];
			СтрокаОблигаций.Валюта = Облигация["currency"];
			СтрокаОблигаций.Сектор = Облигация["sector"];
			СтрокаОблигаций.Эмитент = Облигация["countryOfRiskName"];
			СтрокаОблигаций.ДатаПогашения = Облигация["maturityDate"];
			СтрокаОблигаций.Номинал = Число(Облигация["nominal"]["units"]);
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции  

Функция НовыйДанныеОблигациий()  
	
	ДанныеОблигаций = Новый ТаблицаЗначений;
	ДанныеОблигаций.Колонки.Добавить("Наименование", ОбщегоНазначения.ОписаниеТипаСтрока(50));
	ДанныеОблигаций.Колонки.Добавить("Валюта", ОбщегоНазначения.ОписаниеТипаСтрока(50));
	ДанныеОблигаций.Колонки.Добавить("Сектор", ОбщегоНазначения.ОписаниеТипаСтрока(50));
	ДанныеОблигаций.Колонки.Добавить("Эмитент", ОбщегоНазначения.ОписаниеТипаСтрока(50));
	ДанныеОблигаций.Колонки.Добавить("Тикер", ОбщегоНазначения.ОписаниеТипаСтрока(20));
	ДанныеОблигаций.Колонки.Добавить("ISIN", ОбщегоНазначения.ОписаниеТипаСтрока(20));
	ДанныеОблигаций.Колонки.Добавить("ДатаПогашения", ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата));
	ДанныеОблигаций.Колонки.Добавить("Номинал", ОбщегоНазначения.ОписаниеТипаЧисло(10)); 
	
	Возврат ДанныеОблигаций;
	
КонецФункции

#КонецОбласти