#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Установить цены криптовалютных активов.
// 
// Параметры:
//  ПараметрыУстановки - см. НовыйПараметрыУстановки.
//
Процедура УстановитьЦеныКриптовалютныхАктивов(ПараметрыУстановки) Экспорт
	
	ДокументУстановки = СоздатьДокумент();
	ДокументУстановки.Заполнить(ПараметрыУстановки);
	
	Если ДокументУстановки.ПроверитьЗаполнение() Тогда
		ДокументУстановки.Записать(РежимЗаписиДокумента.Проведение);
	Иначе
		ВызватьИсключение НСтр("ru='Не удалось проверить заполнение цен криптовалют. Документ не создан!'")	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция НовыйПараметрыУстановки() Экспорт
	
	ПараметрыУстановки = Новый Структура;
	ПараметрыУстановки.Вставить("Дата", ТекущаяДатаСеанса());
	ПараметрыУстановки.Вставить("Криптовалюта", Справочники.Криптовалюты.ПустаяСсылка());
	ПараметрыУстановки.Вставить("Цена", 0);
	
	Возврат ПараметрыУстановки;
	
КонецФункции

#КонецОбласти

#КонецЕсли