#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	СформироватьДвиженияПоЦенамКриптовалютныхАктивов();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СформироватьДвиженияПоЦенамКриптовалютныхАктивов()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	УстановкаЦенКриптовалютныхАктивов.Ссылка КАК Регистратор,
	|	УстановкаЦенКриптовалютныхАктивов.Дата КАК Период,
	|	УстановкаЦенКриптовалютныхАктивов.Криптовалюта КАК Криптовалюта,
	|	УстановкаЦенКриптовалютныхАктивов.Цена КАК Цена
	|ИЗ
	|	Документ.УстановкаЦенКриптовалютныхАктивов КАК УстановкаЦенКриптовалютныхАктивов
	|";

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Движения.ЦеныКриптовалютныхАктивов.Записывать = Истина;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Движение = Движения.ЦеныКриптовалютныхАктивов.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, ВыборкаДетальныеЗаписи);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли