#Область ПрограммныйИнтерфейс

// Настройки интеграции CryptoRank.
// 
// Возвращаемое значение:
//  Структура - Настройки интеграции CryptoRank:
// * АдресПодключения - Строка
// * КлючAPI - Строка 
//
Функция НастройкиИнтеграцииCryptoRank() Экспорт
	
	ПараметрыИнтеграции = НовыйПараметрыИнтеграцииCryptoRank();
	ТекущиеПараметры = Константы.НастройкиИнтеграцииCryptoRank.Получить().Получить(); 
	
	Если ЗначениеЗаполнено(ТекущиеПараметры) Тогда
		ЗаполнитьЗначенияСвойств(ПараметрыИнтеграции, ТекущиеПараметры);
	КонецЕсли;	
	
	Возврат ПараметрыИнтеграции;
	
КонецФункции

// Сохранить настройки.
// 
// Параметры:
//  НастройкиИнтеграции - Структура - Настройки интеграции CryptoRank:
// 	* АдресПодключения - Строка
// 	* КлючAPI - Строка 
//
Процедура СохранитьНастройки(НастройкиИнтеграции) Экспорт
	
	Константы.НастройкиИнтеграцииCryptoRank.Установить(Новый ХранилищеЗначения(НастройкиИнтеграции));
	
КонецПроцедуры

// Загрузить список криптовалют с рыночными данными.
//
Процедура ЗагрузитьСписокКриптовалютСРыночнымиДанными() Экспорт
	
	Ответ = ОтветПоСпискуКриптовалютСРыночнымиДанными(); 
	
	ДанныеКриптовалют = Ответ.Получить("data");
	
	Если ДанныеКриптовалют <> Неопределено Тогда
		РазобратьОтветПоСпискуКриптовалют(ДанныеКриптовалют);
	Иначе
		ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации(
			СтрШаблон(НСтр("ru='При получение ответа возникла непредвиденная ситуация: % 1'"), Ответ["error"]),
			УровеньЖурналаРегистрации.Ошибка	 
		);	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура СинхронизацияДанныхПоCryptoRank() Экспорт
	
	ЗагрузитьСписокКриптовалютСРыночнымиДанными();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Разобрать ответ по списку криптовалют.
// 
// Параметры:
//  СписокКриптовалют - Произвольный - Список криптовалют
//
Процедура РазобратьОтветПоСпискуКриптовалют(СписокКриптовалют)
	
	ДанныеКриптовалютныхАктивов = Справочники.Криптовалюты.НовыйДанныеКриптовалютныхАктивовКЗагрузке();
	
	Для Каждого ДанныеКриптовалюты Из СписокКриптовалют Цикл
		ПараметрыКриптовалютногоАктива = ДанныеКриптовалютныхАктивов.Добавить();
		ПараметрыКриптовалютногоАктива.Идентификатор = ДанныеКриптовалюты["id"];
		ПараметрыКриптовалютногоАктива.Наименование = ДанныеКриптовалюты["name"];
		ПараметрыКриптовалютногоАктива.КраткоеОбозначение = ДанныеКриптовалюты["symbol"];
		ПараметрыКриптовалютногоАктива.Логотип = ДанныеКриптовалюты["images"]["x60"];
		ПараметрыКриптовалютногоАктива.Капитализация = ДанныеКриптовалюты["marketCap"];
		ПараметрыКриптовалютногоАктива.Цена = ДанныеКриптовалюты["price"];
		ПараметрыКриптовалютногоАктива.ОбщийОбъем = ДанныеКриптовалюты["totalSupply"];
		ПараметрыКриптовалютногоАктива.МаксимальныйОбъем = ДанныеКриптовалюты["maxSupply"];
	КонецЦикла;
	
	ЗагрузитьНовыеКриптовалютныеАктивы(ДанныеКриптовалютныхАктивов);
	
	КриптовалютныеАктивыКОбработке = Справочники.Криптовалюты.КриптовалютныеАктивыКОбработке(ДанныеКриптовалютныхАктивов);
	
	УстановитьЦеныКриптовалютныхАктивов(КриптовалютныеАктивыКОбработке);
		
КонецПроцедуры

Функция ОтветПоСпискуКриптовалютСРыночнымиДанными()
	
	НастройкиИнтеграции = НастройкиИнтеграцииCryptoRank();
	
	ДополнительныеПараметры = КоннекторHTTP.НовыеПараметры();
	ДополнительныеПараметры.Заголовки.Вставить("Accepts", "application/json");
	ДополнительныеПараметры.Заголовки.Вставить("X-Api-Key", НастройкиИнтеграции.КлючAPI);
	
	СтрокаПодключения = СтрШаблон("%1/v2/currencies", НастройкиИнтеграции.АдресПодключения);
	
	Возврат КоннекторHTTP.GetJson(СтрокаПодключения,, ДополнительныеПараметры);
	
КонецФункции

Функция НовыйПараметрыИнтеграцииCryptoRank() Экспорт
	
	ПараметрыИнтеграции = Новый Структура;
	ПараметрыИнтеграции.Вставить("АдресПодключения", "");
	ПараметрыИнтеграции.Вставить("КлючAPI", "");
	
	Возврат ПараметрыИнтеграции;
	
КонецФункции

Процедура ЗагрузитьНовыеКриптовалютныеАктивы(ДанныеКриптовалютныхАктивов)
	
	ДанныеКриптовалютныхАктивовКЗагрузке = Справочники.Криптовалюты.КриптовалютныеАктивыКЗагрузке(ДанныеКриптовалютныхАктивов);
	
	Для Каждого ДанныеАктива Из ДанныеКриптовалютныхАктивовКЗагрузке Цикл
		ПараметрыЗаполнения = Справочники.Криптовалюты.НовыйПараметрыКриптовалютногоАктива();
		ЗаполнитьЗначенияСвойств(ПараметрыЗаполнения, ДанныеАктива);
		Справочники.Криптовалюты.СоздатьКриптовалютныйАктив(ПараметрыЗаполнения);	
	КонецЦикла;
	
КонецПроцедуры

Процедура УстановитьЦеныКриптовалютныхАктивов(КриптовалютныеАктивыКОбработке)
	
	Для Каждого ДанныеАктива Из КриптовалютныеАктивыКОбработке Цикл
		ПараметрыЗаполнения = Документы.УстановкаЦенКриптовалютныхАктивов.НовыйПараметрыУстановки();
		ЗаполнитьЗначенияСвойств(ПараметрыЗаполнения, ДанныеАктива);
		ПараметрыЗаполнения.Цена = СтроковыеФункцииКлиентСервер.СтрокаВЧисло(ДанныеАктива.Цена);
		Документы.УстановкаЦенКриптовалютныхАктивов.УстановитьЦеныКриптовалютныхАктивов(ПараметрыЗаполнения);	
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти